// Задача 1: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

// int SecNum(int num)
// {
//     int result;
//     if(num > 99 && num < 1000)
//     {
//         int semiresult = num % 100;
//         result = semiresult / 10;
//         return result;
//     }
//     else
//     {
//         result = -1;
//         return result;
//     }
// }

// Console.Write("Input three-digit number: ");
// int UserNumber = Convert.ToInt32(Console.ReadLine());

// int NewNum = SecNum(UserNumber);
// Console.WriteLine("Sec number is " + NewNum);

//Задача 2: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.



//Задача 3: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.